Repository: souccar-github/repGen
Catalog: Resources/Areas/Personnel/Entities/Employee/EmployeeModel.*.resx
Languages: ar

# BloodType
source: Blood Group
ar: زمرة الدم

source: Certifications
ar: الشهادات

source: Children
ar: الأطفال

source: Contacts
ar: جهات الاتصال

source: Convictions
ar: الإدانات

source: Country Of Birth
ar: بلد الولادة

source: Date of Birth
ar: تاريخ الولادة

# DateOfBirthReq
source: date of birth is required
ar: تاريخ الولادة مطلوب

source: Dependents
ar: المعانين

source: Disability Description
ar: وصف العجز

# DisabilityDescriptionLength
source: disability description must be a text with a maximum length of 50 characters
ar: وصف العجز يجب أن يكون نص لايتجاوز 50 محرف

# DisabilityExist
source: Disability Status
ar: حالة العجز

source: Driving License
ar: شهادة السوق

source: Education
ar: التعليم

source: Employee General Info
ar: معلومات عامة حول الموظف

source: Employee Status
ar: حالة الموظف

source: Experiences
ar: الخبرات

source: Family Details
ar: تفاصيل العائلة

source: Father Name
ar: اسم الأب

# FatherNameL2
source: Father Name In Arabic
ar: اسم الأب باللغة العربية

# FatherNameL2Length
source: arabic father name must be a text with a maximum length of 50 characters
ar: اسم الأب باللغة العربية يجب أن يكون نص لايتجاوز 50 محرف

# FatherNameLength
source: father name must be a text with a maximum length of 50 characters
ar: اسم الأب يجب ان يكون نص لايتجاوز 50 محرف

# FatherNameReq
source: father name is required
ar: اسم الأب مطلوب

source: First Name
ar: الاسم الأول

# FirstNameL2
source: First Name In Arabic
ar: الاسم الأول باللغة العربية

# FirstNameL2Length
source: arabic first name must be a text with a maximum length of 50 characters
ar: الاسم الأول باللغة العربية يجب أن يكون نص لايتجاوز 50 محرف

# FirstNameLength
source: first name must be a text with a maximum length of 50 characters
ar: الاسم الأول يجب أن يكون نص لايتجاوز 50 محرف

# FirstNameReq
source: first name is required
ar: الاسم الأول مطلوب

source: Gender
ar: الجنس

# IdentificationNo
source: Identification Number
ar: الرقم الوطني

# IdentificationNoLength
source: identification number must be a text with a maximum length of 50 characters
ar: الرقم الوطني يجب أن يكون نص لايتجاوز 50 محرف

source: Languages
ar: اللغات

source: Last Name
ar: الاسم الأخير

# LastNameL2
source: Last Name In Arabic
ar: الاسم الأخير باللغة العربية

# LastNameL2Length
source: arabic last name must be a text with a maximum length of 50 characters
ar: الاسم الأخير باللغة العربية يجب أن يكون نص لايتجاوز 50 محرف

# LastNameLength
source: last name must be a text with a maximum length of 50 characters
ar: الاسم الأخير يجب أن يكون نص لايتجاوز 50 محرف

# LastNameReq
source: last name is required
ar: الاسم الأخير مطلوب

source: Login Name
ar: اسم تسجيل الدخول

# LoginNameLength
source: login name must be a text with a maximum length of 50 characters
ar: اسم الدخول يجب أن يكون نص لايتجاوز 50 محرف

# LoginNameReq
source: login name is required
ar: اسم تسجيل الدخول مطلوب

source: Marital Status
ar: الحالة الإجتماعية

# MaritalStatusReq
source: marital status is required
ar: الحالة الإجتماعية مطلوبة

source: Middle Name
ar: الاسم الأوسط

# MiddleNameL2
source: Middle Name In Arabic
ar: الاسم الأوسط باللغة العربية

# MiddleNameL2Length
source: arabic middle name must be a text with a maximum length of 50 characters
ar: الاسم الأوسط باللغة العربية يجب أن يكون نص لايتجاوز 50 محرف

# MiddleNameLength
source: middle name must be a text with a maximum length of 50 characters
ar: الاسم الأوسط يجب أن يكون نص لايتجاوز 50 محرف

source: Military Service
ar: الخدمة العسكرية

# MilitaryStatus
source: Military Service Status
ar: حالة الخدمة العسكرية

source: Miscellaneous
ar: متنوعات

source: Mother Name
ar: اسم الأم

# MotherNameL2
source: Mother Name In Arabic
ar: اسم الأم باللغة العربية

# MotherNameL2Length
source: arabic mother name must be a text with a maximum length of 50 characters
ar: اسم الأم باللغة العربية يجب أن يكون نص لايتجاوز 50 محرف

# MotherNameLength
source: mother name must be a text with a maximum length of 50 characters
ar: اسم الأم يجب أن يكون نص لايتجاوز 50 محرف

# MotherNameReq
source: mother name is required
ar: اسم الأم مطلوب

source: Name In First Language
ar: الاسم بلغة أولى

source: Name In Second Language
ar: الاسم بلغة ثانية

source: Nationalities And Birth Information
ar: معلومات حول الولادة والجنسيات

# Nationality
source: Main Nationality
ar: الجنسية الرئيسية

# NationalityReq
source: nationality is required
ar: الجنسية مطلوبة

# NoEmployeeSelectedMessage
source: No Employee Record Selected, Select/Add One To Proceed
ar: لم يتم اختيار أي سجل موظف، اختار\أضف سجل للمتابعة

# NoOfChildren
source: Number Of Children
ar: عدد الأطفال

# NoOfChildrenReq
source: number of children is required
ar: عدد الأطفال مطلوب

# NoOfDependents
source: Number Of Dependents
ar: عدد المعاليين

# NoOfDependentsReq
source: number of dependents is required
ar: عدد المعاليين مطلوب

source: Other Nationality
ar: جنسيات أخرى

source: Passports
ar: جوازات السفر

source: Personal Information
ar: المعلومات الشخصية

source: Personal Photo
ar: الصورة الشخصية

source: Place of Birth
ar: مكان الولادة

# PlaceOfBirthReq
source: place of birth is required
ar: مكان الولادة مطلوب

source: Positions
ar: المناصب

source: Race
ar: العرق

source: Religion
ar: الديانة

source: Residencies
ar: الإقامات

# SelectEmployeeMessage
source: Employees List - Select Row For Details
ar: قائمة الموظفين- اختار صف لعرض التفاصيل

source: Skills
ar: المهارات

# SocialInsuranceNo
source: Social Insurance Number
ar: رقم التأمين الصحي

# SocialInsuranceNoLength
source: social insurance number must be a text with a maximum length of 50 characters
ar: رقم التأمين الصحي يجب أن يكون نص لايتجاوز 50 محرف

# SocialInsuranceNoStatus
source: Social Insurance Status
ar: حالة التأمين الصحي

# SocialSecurityNo
source: Social Security Number
ar: رقم التأمين الإجتماعي

# SocialSecurityNoLength
source: social security number must be a text with a maximum length of 50 characters
ar: رقم التأمين الإجتماعي يجب أن يكون نص لايتجاوز 50 محرف

source: Spouse
ar: الزوجة

source: Training Skills
ar: مهارات التدريب
