Repository: souccar-github/repGen
Catalog: Resources/Areas/ProjectManagment/Entities/Project/ProjectModel.*.resx
Languages: ar

source: Actual Closing Date
ar: تاريخ الانتهاء الفعلي

source: Actual Starting Date
ar: تاريخ البداية الفعلي

# BasicInfoTitle
source: Project No. ({0}) Details
ar: رقم المشروع

source: Code
ar: الرمز

# CodeLength
source: code field must be a text with a maximum length of 50 characters
ar: يجب أن يكون حقل الرمز نصّاً بمقدار أعظمي 50 محرف

# CodeReq
source: Code Field Is Required
ar: حقل الرمز هو حقل إجباري

# CreatePageTitle
source: Project Basic Information
ar: المعلومات الأساسية للمشروع

source: Description
ar: التوصيف

# DescriptionLength
source: description field must be a text with a maximum length of 510 characters
ar: يجب أن يكون حقل التوصيف نصاً بمقدار أعظمي قدره 510 محرف

# DescriptionReq
source: Description Field Is Required
ar: حقل التوصيف هو حقل إجباري

source: Name
ar: الاسم

# NameLength
source: name field must be a text with a maximum length of 255 characters
ar: حقل الاسم يجب أن يكون نصاً بمقدار قدره 255 محرف

# NameReq
source: Name Field Is Required
ar: حقل الاسم هو حقل إجباري

source: Node
ar: العقدة

# Owner
source: Prime Owner Employee
ar: الموظف ذو الصلاحيات الأساسية

source: Planned Closing Date
ar: تاريخ الانتهاء المخطط له

source: Planned Starting Date
ar: تاريخ البداية المخطط له

# Position
source: Job Title
ar: المسمّى الوظيفي

# ProjectConstraintPluralTitle
source: Project Constraints
ar: قيود المشروع ( مجموع )

# ProjectConstraintSingleTitle
source: Project Constraint
ar: قيد المشروع مفرداً

# ProjectEvaluationPluralTitle
source: Project Evaluations
ar: تقييم المشروع مجموع

# ProjectEvaluationSingleTitle
source: Project Evaluation
ar: تقييم المشروع مفرداً

# ProjectKpiPluralTitle
source: Project KPI's
ar: مؤشرات الأداء المتعلقة بالمشروع مجموع

# ProjectKpiSingleTitle
source: Project KPI
ar: مؤشرات الأداء المتعلقة بالمشروع مفرداً

# ProjectMasterGridTitle
source: Projects List - Select Row For Details
ar: قائمة المشاريع - يرجى اختيار الصف لعرض التفاصيل

# ProjectPhasePluralTitle
source: Project Phases
ar: مراحل المشروع مجموع

# ProjectPhaseSingleTitle
source: Project Phase
ar: مراحل المشروع مفرداً

# ProjectResourcePluralTitle
source: Project Resources
ar: موارد المشروع مجموع

# ProjectResourceSingleTitle
source: Project Resource
ar: موارد المشروع مفرداً

# ProjectSuccessFactorPluralTitle
source: Project Success Factors
ar: عوامل نجاح المشروع مجموع

# ProjectSuccessFactorSingleTitle
source: Project Success Factor
ar: عوامل نجاح المشروع مفرداً

# ProjectTeamPluralTitle
source: Project Teams
ar: فرق العمل على المشروع مجموع

# ProjectTeamSingleTitle
source: Project Team
ar: فريق العمل على المشروع مفرداً

source: Rate
ar: التقييم

source: Type
ar: النوع
