Repository: souccar-github/repGen
Catalog: Resources/Shared/Messages/General.*.resx
Languages: ar

# AssignEmployeeToPositionMessage
source: Assign Positions To This Employee
ar: تعيين مناصب وظيفية لهذا الموظف

source: Assign Organizational Objective
ar: تعيين أهداف منظماتية

# CanCreateMessage
source: You Are Not Allowed To Add !!
ar: لا يسمح لك بالإضافة

# CanDeleteMessage
source: You Are Not Allowed To Delete !!
ar: لا يسمح لك بالحذف

# CanReadMessage
source: You Are Not Allowed To Browse This Module !!
ar: لا يسمح لك بتصفح محتويات هذه الوحدة

# CanUpdateMessage
source: You Are Not Allowed To Update !!
ar: لا يسمح لك بالتحديث

# Confirm
source: Are You Sure You Want To Proceed With This Operation?
ar: هل أنت متأكد من أنك تريد الاستمرار بهذه العملية؟

# DeleteConfirm
source: Are you sure you want to Delete? This action cannot be undone.
ar: هل أنت متأكد من أنك تريد الحذف؟ هذا الفعل لا يمكن إلغاؤه

# DoneMessage
source: Done !
ar: تم بنجاح

# DuplicateValueError
source: Value {0} already exists.
ar: القيمة {0} موجودة مسبقاً

# EntityCurrentlyInUse
source: Can't Delete Selected Entity Since It's Currently In Use
ar: لا يمكن حذف الكيان المختار لأنه قيد الاستخدام

# ErrorDuringDelete
source: Error During Delete ! Please try Again
ar: حدث خطأ أثناء الحذف ! يرجى المحاولة مرة ثانية

# ErrorWhileUpdate
source: Error While Insert, Please Try Again Later !!
ar: حصل خطأ أثناء عملية التعديل,يرجى المحاولة مرة أخرى.

# GeneralErrorOccurred
source: Error Occurred ... Contact System Administrator
ar: حدث خطأ... يرجى الاتصال مع مسؤول تقانات المعلومات

# ImageTypeMessage
source: Please Select Image [ jpg | png ]
ar: يرجى اختيار صورة

# IndexInUse
source: Index Already In Use
ar: إن المؤشر المختار قيد الاستخدام

# LoginNameExistMessage
source: Login Name Already Exists. It's Reserved by "{0}" "{1}" !
ar: إن اسم المستخدم تم استعماله مسبقاً و تم حجزه من قبل

# ModifyMessage
source: Click Here To Modify List
ar: انقر هنا لتعديل القائمة

# NoFileUoload
source: No file uploaded
ar: لم يتم تحميل أي ملف

# NoIdexes
source: No Indexes
ar: لا توجد مؤشرات (فهارس)

# NoPhotoDelete
source: there is no photo to delete!
ar: لا يوجد صورة كي يتم حذفها

# NotAllowedToAddMessage
source: You Are Not Allowed To Add
ar: من غير المسموح لك بالإضافة

# NotAllowedToDeleteMessage
source: You Are Not Allowed To Delete
ar: من غير المسموح لك بالحذف

# NotAllowedToEditMessage
source: You Are Not Allowed To Edit
ar: من غير المسموح لك بالإضافة

# ReferncesValueError
source: You can't do this because child data exits.
ar: لا يمكنك حذف هذا السجل بسبب وجود أبناء له.

# RelatedEmployee
source: Related Employee is Required
ar: من المطلوب وجود موظف صاحب علاقة

# RelatedNode
source: Related Node is Required
ar: العقدة المرتبطة

# RelatedPosition
source: Related Position is Required
ar: إن المنصب الوظيفي المرتبط هو حقل إجباري

# RTFTypeMessage
source: Please Select File [ rtf ]
ar: Please Select File [ rtf ]س

# SelectImageMessage
source: Please Select Image Before Uploading
ar: يرجى اختيار الصورة قبل رفعها

# SelectRtfFileMessage
source: Please Select RTF file Before Uploading
ar: Please Select RTF file Before Uploadingس

# UploadPhotoDialogTitle
source: Upload Photo
ar: رفع صورة

source: Welcome
ar: أهلاً

source: Welcome Back
ar: أهلاً بعودتك

# YouCanNotDoThis
source: You can't do this
ar: لا يمكنك القيام بهذا الفعل
